; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-3-5-4)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	s0 - location
	s1 - location
	s2 - location
	p0-1 - location
	p0-2 - location
	p2-0 - location
	p2-1 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s1)
	(at driver3 s1)
	(at truck1 s0)
	(empty truck1)
	(at truck2 s0)
	(empty truck2)
	(at truck3 s0)
	(empty truck3)
	(at truck4 s2)
	(empty truck4)
	(at truck5 s1)
	(empty truck5)
	(at package1 s2)
	(at package2 s0)
	(at package3 s0)
	(at package4 s0)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 28)
	(= (time-to-walk p0-1 s0) 28)
	(= (time-to-walk s1 p0-1) 99)
	(= (time-to-walk p0-1 s1) 99)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 21)
	(= (time-to-walk p0-2 s0) 21)
	(= (time-to-walk s2 p0-2) 66)
	(= (time-to-walk p0-2 s2) 66)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(= (time-to-walk s2 p2-1) 20)
	(= (time-to-walk p2-1 s2) 20)
	(= (time-to-walk s1 p2-1) 47)
	(= (time-to-walk p2-1 s1) 47)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 72)
	(= (time-to-drive s1 s0) 72)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 33)
	(= (time-to-drive s2 s1) 33)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 57)
	(= (time-to-drive s0 s2) 57)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver3 s2)
	(at truck3 s1)
	(at truck4 s2)
	(at truck5 s2)
	(at package1 s0)
	(at package2 s2)
	(at package3 s0)
	(at package4 s1)
	))

(:metric minimize (+ (+ (* 4  (total-time)) (* 3  (driven))) (* 4  (walked))))

)

; plan
1. (board-truck driver1 truck3 s0)
   deleted: (at driver1 s0) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 2 of 8
2. (walk driver3 s1 p2-1)
   deleted: (at driver3 s1)
   added: (at driver3 p2-1)
   changed: (walked) from 0 to 47
   goals met: 2 of 8
3. (walk driver3 p2-1 s2)
   deleted: (at driver3 p2-1)
   added: (at driver3 s2)
   changed: (walked) from 47 to 67
   goals met: 3 of 8
4. (board-truck driver2 truck5 s1)
   deleted: (at driver2 s1) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 3 of 8
5. (load-truck package2 truck3 s0)
   deleted: (at package2 s0)
   added: (in package2 truck3)
   goals met: 3 of 8
6. (load-truck package4 truck3 s0)
   deleted: (at package4 s0)
   added: (in package4 truck3)
   goals met: 3 of 8
7. (drive-truck truck3 s0 s1 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   changed: (driven) from 0 to 72
   goals met: 4 of 8
8. (drive-truck truck5 s1 s2 driver2)
   deleted: (at truck5 s1)
   added: (at truck5 s2)
   changed: (driven) from 72 to 105
   goals met: 5 of 8
9. (unload-truck package4 truck3 s1)
   deleted: (in package4 truck3)
   added: (at package4 s1)
   goals met: 6 of 8
10. (load-truck package1 truck5 s2)
   deleted: (at package1 s2)
   added: (in package1 truck5)
   goals met: 6 of 8
11. (drive-truck truck5 s2 s0 driver2)
   deleted: (at truck5 s2)
   added: (at truck5 s0)
   changed: (driven) from 105 to 162
   goals met: 5 of 8
12. (unload-truck package1 truck5 s0)
   deleted: (in package1 truck5)
   added: (at package1 s0)
   goals met: 6 of 8
13. (drive-truck truck5 s0 s2 driver2)
   deleted: (at truck5 s0)
   added: (at truck5 s2)
   changed: (driven) from 162 to 219
   goals met: 7 of 8
14. (drive-truck truck3 s1 s2 driver1)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   changed: (driven) from 219 to 252
   goals met: 6 of 8
15. (unload-truck package2 truck3 s2)
   deleted: (in package2 truck3)
   added: (at package2 s2)
   goals met: 7 of 8
16. (drive-truck truck3 s2 s1 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   changed: (driven) from 252 to 285
   goals met: 8 of 8
